{
  "activation_dropout": 0.0,
  "activation_function": "gelu",
  "architectures": [
    "MBartForSequenceClassification"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 0,
  "classifier_dropout": 0.0,
  "d_model": 1024,
  "decoder_attention_heads": 16,
  "decoder_ffn_dim": 4096,
  "decoder_layerdrop": 0.0,
  "decoder_layers": 12,
  "decoder_start_token_id": 2,
  "dropout": 0.1,
  "encoder_attention_heads": 16,
  "encoder_ffn_dim": 4096,
  "encoder_layerdrop": 0.0,
  "encoder_layers": 12,
  "eos_token_id": 2,
  "forced_eos_token_id": 2,
  "gradient_checkpointing": false,
  "id2label": {
    "0": "Anger",
    "1": "Disgust",
    "2": "Enjoyment",
    "3": "Fear",
    "4": "Other",
    "5": "Sadness",
    "6": "Surprise"
  },
  "init_std": 0.02,
  "is_encoder_decoder": true,
  "label2id": {
    "Anger": 0,
    "Disgust": 1,
    "Enjoyment": 2,
    "Fear": 3,
    "Other": 4,
    "Sadness": 5,
    "Surprise": 6
  },
  "max_position_embeddings": 1024,
  "model_type": "mbart",
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "problem_type": "single_label_classification",
  "scale_embedding": false,
  "tokenizer_class": "BartphoTokenizer",
  "torch_dtype": "float32",
  "transformers_version": "4.52.4",
  "use_cache": true,
  "vocab_size": 40030
}
